zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc00/atdf/PIC32CK1012GC00048.atdf
        <module name="FPB" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPB">
            <register-group name="FPB" name-in-module="FPB" address-space="base" offset="0xE0002000"/>
            <parameters>
              <param name="__BKPT_NUM" value="8" caption="Number of FPB breakpoint comparators"/>
            </parameters>
          </instance>
        </module>
        <module name="FPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPU">
            <register-group name="FPU" name-in-module="FPU" address-space="base" offset="0xE000EF30"/>
            <parameters>
              <param name="TYPE" value="8" caption="FPU architecture type"/>
            </parameters>
          </instance>
        </module>
        <module name="FREQM" id="03707" name2="clk_freqm_u2257_v3" version="3a0">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x44014000"/>
            <parameters>
              <param name="GCLK_ID_MSR_0" value="2" caption="Index of measure generic clock 0"/>
              <param name="GCLK_ID_MSR_1" value="3" caption="Index of measure generic clock 1"/>
              <param name="GCLK_ID_REF" value="4" caption="Index of reference generic clock"/>
              <param name="MSRCLK_NB" value="2" caption="Number of measured clock sources"/>
              <param name="INSTANCE_ID" value="10" caption="Instance index for FREQM"/>
              <param name="MCLK_ID_APB" value="42" caption="Index for FREQM APB clock"/>
              <param name="PAC_ID" value="10" caption="Index for FREQM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="fuses" name2="fuses" version="1a0">
          <instance name="FUSES">
            <register-group name="FUSES_BOOTCFG1" name-in-module="FUSES_BOOTCFG1" address-space="base" offset="0x0A002000"/>
            <register-group name="FUSES_BOOTCFG2" name-in-module="FUSES_BOOTCFG1" address-space="base" offset="0x0A00A000"/>
            <register-group name="FUSES_DALCFG" name-in-module="FUSES_DALCFG" address-space="base" offset="0x0A004000"/>
            <register-group name="FUSES_USERCFG1" name-in-module="FUSES_USERCFG1" address-space="base" offset="0x0A000000"/>
            <register-group name="FUSES_USERCFG2" name-in-module="FUSES_USERCFG1" address-space="base" offset="0x0A008000"/>
            <register-group name="FUSES_CALOTP" name-in-module="FUSES_CALOTP" address-space="base" offset="0x0A007000"/>
            <parameters>
              <param name="RDY_MSB" value="14"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="03726" name2="clk_gclk_u2122_v1" version="1d0">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x44010000"/>
            <signals>
              <signal group="IO" index="0" function="M" pad="PA09" ioset="2"/>
              <signal group="IO" index="0" function="M" pad="PA03" ioset="1"/>
              <signal group="IO" index="1" function="M" pad="PA01" ioset="1"/>
              <signal group="IO" index="1" function="M" pad="PA10" ioset="2"/>
              <signal group="IO" index="2" function="M" pad="PC00" ioset="1"/>
              <signal group="IO" index="3" function="M" pad="PC01" ioset="1"/>
              <signal group="IO" index="4" function="M" pad="PC02" ioset="1"/>
              <signal group="IO" index="4" function="M" pad="PD06" ioset="2"/>
              <signal group="IO" index="5" function="M" pad="PC03" ioset="1"/>
              <signal group="IO" index="5" function="M" pad="PD07" ioset="2"/>
              <signal group="IO" index="7" function="M" pad="PC05" ioset="1"/>
            </signals>
            <parameters>
              <param name="GEN_BITS" value="4"/>
              <param name="GEN_NUM" value="12" caption="Number of Generic Clock Generators"/>
              <param name="GEN_NUM_MSB" value="11" caption="Number of Generic Clock Generators - 1"/>
              <param name="GEN_SOURCE_NUM_MSB" value="11" caption="Number of Generic Clock Sources - 1"/>
              <param name="IO_NUM" value="8" caption="Number of Generic Clock I/Os"/>
              <param name="NUM" value="48" caption="Number of Generic Clock Users"/>
              <param name="SOURCE_BITS" value="4"/>
              <param name="SOURCE_NUM" value="12" caption="Number of Generic Clock Sources"/>
              <param name="INSTANCE_ID" value="8" caption="Instance index for GCLK"/>
              <param name="MCLK_ID_APB" value="40" caption="Index for GCLK APB clock"/>
              <param name="PAC_ID" value="8" caption="Index for GCLK registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="HMATRIX2" id="bus_hmatrix2_v5" name2="bus_hmatrix2_v5" version="5f0">
          <instance name="HMATRIX">
            <register-group name="HMATRIX" name-in-module="HMATRIX2" address-space="base" offset="0x44806000"/>
            <parameters>
              <param name="INSTANCE_ID" value="35" caption="Instance index for HMATRIX"/>
              <param name="MCLK_ID_AHB" value="10" caption="Index for HMATRIX AHB clock"/>
              <param name="MCLK_ID_APB" value="67" caption="Index for HMATRIX APB clock"/>
              <param name="PAC_ID" value="35" caption="Index for HMATRIX registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="ICB" id="SYSTEM_IP" version="1.0.0">
          <instance name="ICB">
            <register-group name="ICB" name-in-module="ICB" address-space="base" offset="0xE000E000"/>
          </instance>
        </module>
        <module name="IDAU" id="04250" name2="sec_idau_v3" version="3a0">
          <instance name="IDAU">
            <register-group name="IDAU" name-in-module="IDAU" address-space="base" offset="0x4480C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="38" caption="Instance index for IDAU"/>
              <param name="MCLK_ID_APB" value="69" caption="Index for IDAU APB clock"/>
              <param name="PAC_ID" value="38" caption="Index for IDAU registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="ITM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ITM">
            <register-group name="ITM" name-in-module="ITM" address-space="base" offset="0xE0000000"/>
