zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc00/atdf/PIC32CK1012GC00048.atdf
      <value-group name="BGCR__CONTR">
        <value name="GO_ON" caption="Not affected" value="0"/>
        <value name="RESTART" caption="Restart" value="1"/>
      </value-group>
      <value-group name="BGCR__RWCTRL">
        <value name="DISABLE" caption="Disable Read Wait Control" value="0"/>
        <value name="ENABLE" caption="Enable Read Wait Control" value="1"/>
      </value-group>
      <value-group name="BGCR__INTBG">
        <value name="DISABLED" caption="Disabled" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="WCR__WKENCINT">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="WCR__WKENCINS">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="WCR__WKENCREM">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="CCR__INTCLKEN">
        <value name="OFF" caption="Stop" value="0"/>
        <value name="ON" caption="Oscillate" value="1"/>
      </value-group>
      <value-group name="CCR__INTCLKS">
        <value name="NOT_READY" caption="Not Ready" value="0"/>
        <value name="READY" caption="Ready" value="1"/>
      </value-group>
      <value-group name="CCR__SDCLKEN">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="CCR__CLKGSEL">
        <value name="DIV" caption="Divided Clock Mode" value="0"/>
        <value name="PROG" caption="Programmable Clock Mode" value="1"/>
      </value-group>
      <value-group name="SRR__SWRSTALL">
        <value name="WORK" caption="Work" value="0"/>
        <value name="RESET" caption="Reset" value="1"/>
      </value-group>
      <value-group name="SRR__SWRSTCMD">
        <value name="WORK" caption="Work" value="0"/>
        <value name="RESET" caption="Reset" value="1"/>
      </value-group>
      <value-group name="SRR__SWRSTDAT">
        <value name="WORK" caption="Work" value="0"/>
        <value name="RESET" caption="Reset" value="1"/>
      </value-group>
      <value-group name="NISTR__CMDC">
        <value name="NO" caption="No command complete" value="0"/>
        <value name="YES" caption="Command complete" value="1"/>
      </value-group>
      <value-group name="NISTR__TRFC">
        <value name="NO" caption="Not complete" value="0"/>
        <value name="YES" caption="Command execution is completed" value="1"/>
      </value-group>
      <value-group name="NISTR__BLKGE">
        <value name="NO" caption="No Block Gap Event" value="0"/>
        <value name="STOP" caption="Transaction stopped at block gap" value="1"/>
      </value-group>
      <value-group name="NISTR__DMAINT">
        <value name="NO" caption="No DMA Interrupt" value="0"/>
        <value name="YES" caption="DMA Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="NISTR__BWRRDY">
        <value name="NO" caption="Not ready to write buffer" value="0"/>
        <value name="YES" caption="Ready to write buffer" value="1"/>
      </value-group>
      <value-group name="NISTR__BRDRDY">
        <value name="NO" caption="Not ready to read buffer" value="0"/>
        <value name="YES" caption="Ready to read buffer" value="1"/>
      </value-group>
      <value-group name="NISTR__CINS">
        <value name="NO" caption="Card state stable or Debouncing" value="0"/>
        <value name="YES" caption="Card inserted" value="1"/>
      </value-group>
      <value-group name="NISTR__CREM">
        <value name="NO" caption="Card state stable or Debouncing" value="0"/>
        <value name="YES" caption="Card Removed" value="1"/>
      </value-group>
      <value-group name="NISTR__CINT">
        <value name="NO" caption="No Card Interrupt" value="0"/>
        <value name="YES" caption="Generate Card Interrupt" value="1"/>
      </value-group>
      <value-group name="NISTR__ERRINT">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="EISTR__CMDTEO">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Timeout" value="1"/>
      </value-group>
      <value-group name="EISTR__CMDCRC">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="CRC Error Generated" value="1"/>
      </value-group>
      <value-group name="EISTR__CMDEND">
        <value name="NO" caption="No error" value="0"/>
        <value name="YES" caption="End Bit Error Generated" value="1"/>
      </value-group>
      <value-group name="EISTR__CMDIDX">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="EISTR__DATTEO">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Timeout" value="1"/>
      </value-group>
      <value-group name="EISTR__DATCRC">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="EISTR__DATEND">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="EISTR__CURLIM">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Power Fail" value="1"/>
      </value-group>
      <value-group name="EISTR__ACMD">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="EISTR__ADMA">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="EISTR__BOOTAE">
        <value name="0" caption="FIFO contains at least one byte" value="0"/>
        <value name="1" caption="FIFO is empty" value="1"/>
      </value-group>
      <value-group name="NISTER__CMDC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="NISTER__TRFC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
